---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.ValidationStatus.NoMaterial
enum: Autodesk.Revit.DB.Fabrication.ValidationStatus
source: html/bf3700c3-dd66-1655-a0cd-e610c1aff5f2.htm
---
# Autodesk.Revit.DB.Fabrication.ValidationStatus.NoMaterial

The part has no material being specified.